readme: replace ascii diagram with mermaid
